justinh-rahb/DragonVent/firmware/sdkconfig.defaults
# Target the classic ESP32 (Xtensa dual-core LX6) — same silicon as stock.
CONFIG_IDF_TARGET="esp32"

# 4 MB flash matches the stock Panda Vent module (see esptool image-info).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Use our OTA-capable partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Room for logs before wifi/httpd come up.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Captive-portal detection probes from iOS / Android / Windows arrive with
# 700+ bytes of headers; the 512 B default returns 431 which browsers show as
# "Header fields are too long for server to interpret".
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# The default LWIP pool (10 sockets) is shared by the single-worker httpd, the
# Moonraker WebSocket, mDNS, and Bambu SSDP discovery. A browser opening the SPA
# fires ~6 concurrent requests (page + polls); at 10 sockets those get refused
# once the background consumers are counted, so the UI intermittently fails to
# load. 16 gives httpd real concurrency headroom (esp_http_server sizes its open
# sockets from this too).
CONFIG_LWIP_MAX_SOCKETS=16
